["A system for routing between autonomous systems connected to peer routers, the system comprising, for each peer router, two routing modules enabling routing to be performed between autonomous systems, only one of the modules being in an active state at any given instant, the others being in a standby state, and means enabling one of said other routing modules to switch from a standby state to an active state in the event of the routing module that is in the active state stopping.", "Fault-tolerant system for routing between autonomous systems "]
["A method which can be implemented on a computer program product for use on a network of autonomous systems to provide an ability to exclude the routing of messages to a destination IP address through a specified autonomous system. On a network in which each autonomous system ignores update messages that already include its identification number and adds it own identification number to update messages that it forwards, the method involves adding the identification number of the specified autonomous system to any update message created for the destination IP address.", "Exclusion list of senders to an autonomous system "]
["The present invention relates to providing virtual private network (VPN) services between two or more Autonomic Systems (AS). An aggregation edge router (ASBR) is provided in two or more autonomous systems (Asx,Asy). The aggregation edge routers are configured such that routing peering between the two or more autonomous systems is done between the aggregation edge routers in these autonomous systems. Each aggregation edge router is a routing peer of other edge routers (PE) in its own autonomous system. The Multi-Protocol Label Switching (MPLS) network is used between the different autonomous systems.", "Method for Providing Virtual Private Network Services Between Autonomous Systems "]
["A rapid method and apparatus for remapping the type of service (TOS) and source address information from an incoming communications packet according to the desired Quality of Service (QoS) required for the communications flow into a switch or router are described. The input source address field of the packet header is used to access a lookup table of corresponding source autonomous system (AS) labels. The appropriate AS label is combined with the input TOS yielding an intra-switch TOS optimized for the QoS appropriate to the received flow. Alternatively, the netID, a subset of the source address, may be used directly without resort to a lookup table. As a further alternative, the destination address may be used in conjunction with the above. The resulting intra-switch TOS expedites packet management and throughput in the switch/router, facilitating the efficient delivery of the required Quality of Service for that flow.", "Hardware TOS remapping based on source autonomous system identifier "]
["A system and method for an auxiliary network for a peer-to-peer overlay network using autonomous system level topology. Using information available through the auxiliary network, expressway connections are established amongst expressway nodes and ordinary connections are established between ordinary and expressway nodes. The connections established is unconstrained and arbitrary. After the connections are established, efficient routing of information may take place.", "Autonomous system topology based auxiliary network for peer-to-peer overlay network "]
["A method for determining a cumulative network layer reachability cost of traversing one or more autonomous network routing systems comprises receiving first network route information from an originating customer edge router, wherein the first network route information identifies a route in a customer network; determining a transit cost from the provider edge router to an endpoint associated with the originating customer edge router based upon a metric value received in a cost community attribute; repeating the determining step for each of one or more autonomous systems that lie in a path from the originating customer edge router to a destination customer edge router, to result in determining an accumulated transit costs across one or more autonomous systems; and determining, based at least in part upon the accumulated transit cost, a best path from the provider edge router to the endpoint associated with the originating customer edge router.", "Method of determining transit costs across autonomous systems "]
["A system, device, and method for establishing label switched paths across multiple autonomous systems involves establishing a label switched path in each autonomous system, and, at each shared border device, linking an incoming label switched path in an incoming autonomous system to an outgoing label switched path in an outgoing autonomous system. The Label Distribution Protocol is preferably used to establish the label switched path between border devices in each autonomous system. Each border device maps a label associated with the incoming label switched path to a label associated with the outgoing label switched path. When a border device receives a protocol message including the label associated with the incoming label switched device, the border device replaces the label in the protocol message with the label associated with the outgoing label switched path, and forwards the protocol message to the downstream neighboring (next hop) device in the outgoing autonomous system.", "System, device, and method for establishing label switched paths across multiple autonomous systems "]
["The present invention is directed to a system for linking a first autonomous network system to at least one second autonomous network system. The first autonomous network system having a first private IP address space and the at least one second autonomous network system having at least one second private IP address space. The first private IP address space and the at least one second private IP address space are at least partially overlapping. The system includes a first routing domain including the first autonomous network system and at least one second routing domain including the at least one second autonomous network system. A geographically diverse linking autonomous system couples the first autonomous network system and the at least one second autonomous network system. The linking autonomous system includes a first routing domain management system configured to manage the first routing domain, and at least one second routing domain management system configured to manage the at least one second routing domain.", "Linking autonomous systems with dual premise routing domains "]
["An approach for providing network security is disclosed. The system includes a first set of routing devices (e.g., routers, routing switches, etc.) operating redundantly within an autonomous system. The system also includes a second set of routing devices that are configured for redundant operation within the autonomous system and to communicate with another autonomous system. The sets of routing devices provide a communication path between the autonomous systems for transport of untrusted packets and trusted packets. Further, the system includes a security node (i.e., weighstation) configured to communicate with the sets of routing devices and to only receive the untrusted packets, wherein the untrusted packets are selectively forwarded to the other autonomous system.", "Inter-autonomous system weighstation "]
["The present invention provides for controlling incoming traffics on the links to an autonomous system. Incoming traffic usage for blocks of IP addresses within an autonomous system and load, congestion and capacity of the links for the incoming traffic is monitored to determine the optimal link for incoming traffic destined for a block of IP addresses. Incoming traffic for a block of IP addresses is biased towards the optimal link by configuring the border routers to announce the block of IP addresses via Border Gateway Protocol (BGP) across the non-optimal links with one or more local AS numbers pre-pended, causing the non-optimal links to look as if they are of a greater routing distance than the optimal link. In addition, outgoing traffic for a session is separately controlled by tagging the packets of the session for a specific link, causing the router to send the packet out the optimal link.", "Controlling traffic on links between autonomous systems "]
["An error logging and analysis system is used to detect a type of error condition, assign a numeric value corresponding to the severity of the error condition, record the time of the error condition, and determine the frequency between subsequent error conditions of the same type. A weighted error rate is generated as a function of the severity of the initial error condition, the frequency of subsequent error conditions, and a percentage of any preceding weighted error rates. These weighted error rates are compared to a predetermined threshold to determine if the error condition is statistically significant.", "Efficient real-time analysis method of error logs for autonomous systems "]
["Systems and methods are disclosed for managing the traffic between autonomous systems in the Internet. Data on links on border routers between autonomous systems is collected and analyzed at certain traffic times. Once determined, traffic on various customer facing interfaces at that time is associated with an Internet Prefix. Then, the aggregate traffic volume for each Internet Prefix is allocated to a first link on a primary routing basis and to a second link on a secondary routing basis. These routes are announced to a provisioning system that in turn, configures various border routers, which in turn announce the new routes using the Internet Border Gateway Protocol. In this manner, inter-autonomous traffic is managed to facilitate traffic distribution on the links according to criteria defined by network provider, allowing resources to be better utilized and network traffic to be maintained if a link fails.", "Systems and methods for traffic management between autonomous systems in the Internet "]
["A system and method of tracing network flows in an autonomous communications system are described. The Autonomous System may be formed of multiple subgroups depending on size and application. Each subgroup contains multiple, interconnected routers which participate in transporting data flow across the Autonomous System (AS). A Director within the AS has a full and complete vision of the network topology. When it is desired to trace a particular flow because of an identified attack, selected routers in key locations—through which that particular flow travels—mark packets with labels which enable the tracing of the path. These labels permit the source of the attack, at least in so far as it travels through the AS, to be identified. If the number of entry (or key) points to the AS is larger than the number of available labels, the AS will be divided into subgroups, the flow is traced from subgroup to subgroup.", "Mechanism for tracing back anonymous network flows in autonomous systems "]
["Systems and methods for computing the paths of MPLS Traffic Engineering LSPs across Autonomous System and/or area boundaries. A distributed path computation algorithm exploits multiple path computation elements (PCEs) to develop a virtual shortest path tree (VSPT) resulting in computation of an end-to-end optimal (shortest) path. In some implementations, the VSPT is computed recursively across all the Autonomous Systems and/or areas between the head-end and tail-end of the Traffic Engineering LSP.", "Computing inter-autonomous system MPLS traffic engineering LSP paths "]
["A content delivery network includes first and second sets of cache servers, a domain name server, and an anycast island controller. The first set of cache servers is hosted by a first autonomous system and the second set of cache servers is hosted by a second autonomous system. The cache servers are configured to respond to an anycast address for the content delivery network, to receive a request for content from a client system, and provide the content to the client system. The first and second autonomous systems are configured to balance the load across the first and second sets of cache servers, respectively. The domain name server is configured to receive a request from a requestor for a cache server address, and provide the anycast address to the requestor in response to the request. The anycast island controller is configured to receive load information from each of the cache servers, determine an amount of requests to transfer from the first autonomous system to the second autonomous system; send an instruction to the first autonomous system to transfer the amount of requests to the second autonomous system.", "Multi-Autonomous System Anycast Content Delivery Network "]
["A method for exchanging routing information between I-BGP routers within an autonomous system (AS) advantageously enables a solution to both persistent route oscillation problems and transient route oscillation problems which may occur when using I-BGP in a given AS. Conventional I-BGP protocol techniques are extended by enabling I-BGP speakers (e.g., routers) to communicate a set of possible best paths to a given destination, rather than communicating only a single best path, to each of their I-BGP peers within the given AS. Specifically, a plurality of possible best paths to a destination are communicated (where there are in fact more than one) from an I-BGP speaker in a given AS to its I-BGP peers (within the given AS), for each neighboring AS that provides any such paths (i.e., routes to the destination).", "Method and apparatus for exchanging routing information within an autonomous system in a packet-based data network "]
["A network topology map and a system and method of annotating a network topology map of a packet network is described which monitors traffic engineering extensions in link state advertisement packets. Traffic engineering information contained in traffic engineering extensions is extracted and the traffic engineering information is used to annotate the network topology map with network attributes, such as bandwidth information and traffic engineering metrics.", "Tracking of traffic engineering topology in an autonomous system "]
["Systems and methods for performing tele-operations with the active assistance and supervision of a cognitive agent, such as a human being, who generates a future path plan in real time for immediate use by an automated on-line controlled agent, such as a work robot or other manipulator, are disclosed. The systems and methods may employ a visual display to present images of the controlled agent, of a foward simulation of the controlled agent, and of the future path plan being generated to enable a human operator to assess and control the on-going activity. The system simultaneously operates the controlled agent and produces the forward simulation and path plan, all under real time conditions. The cognitive agent, display and forward simulation equipment may be at one location and the controlled agent and its controller at another remote location. The forward simulation may be selectively operated in one of three modes: a time-and-position synchronized mode, a position-synchronized, time-desynchronized mode, and a mode where neither time nor position are synchronized with the controlled agent. The desynchronization of time and of position of the forward simulation with respect to the controlled agent is accomplished by use of a time clutch and a position clutch. The forward simulation can also be reversed through the use of a time brake, and the time ratio between the forward simulation time and real time can be adjusted. Finally, a method for transferring active control of functioning autonomously-operated equipment from one cognitive agent to another cognitive agent under real time conditions is disclosed.", "Tele-autonomous system and method employing time/position synchrony/desynchrony "]
["A method is disclosed for operating a mobile station, the method including a first step of storing information in the mobile station, the stored information indicating a frequency of a digital control channel of at least one public cellular communications system in the vicinity of an autonomous communications system. The stored information further specifies a frequency channel associated with the autonomous communications system. The autonomous communications system is one of a private system or a residential system. A second step is executed upon a termination of a call using an analog voice channel or a digital traffic channel of a public cellular communications system, wherein the mobile station receives a message from the public cellular communications system, the received message including information indicating a frequency of a digital control channel of the public cellular communications system. A third step of the method compares the information of the received message with the stored information to determine if a match exists between the digital control channels. If a match is found to exist, it is determined that the mobile station is operating in a public cellular communications system that is in the vicinity of the autonomous communications system. In this case the mobile station attempts to tune to a control channel of the autonomous wireless communications system, using the stored information that further specifies a frequency associated with the autonomous communications system.", "Method and apparatus to speed up autonomous system selection after call release "]
["A layer-2 virtual-private-network (L2-VPN) service with automatic discovery and connection establishment is provided within a wide-area, multiple-autonomous-system (AS) network according to one of two approaches. In the first approach, inter-AS tunnels are used to connect pairs of provider edge (PE) routers of different ASes, and the PE routers then establish signaling connections to each other which are used to create pseudowires that implement the layer-2 connectivity. A second approach utilizes so-called “pseudowire switching” in which separate pseudowires are created within each AS and between ASes, and then the separate pseudowires are stitched together to form end-to-end connections. The first approach has the benefit of transparent operation provided by the tunnel, while the second approach requires fewer inter-AS signaling connections.", "Inter-autonomous-system virtual private network with autodiscovery and connection signaling "]
["A system includes first and second transmitters attachable to first and second vehicles. The transmitters can each transmit successive signals at predetermined time intervals. Tracking stations at different locations are configured to receive the signals transmitted by at least one of the first and second transmitters, distinguish signals transmitted by the first transmitter from signals transmitted by the second transmitter, and determine from the transmitted signals respective position information for at least one of the first and second transmitters. Each of the tracking stations is further configured to be in signal communication with at least one other of the tracking stations. The system further includes at least one processing device in signal communication with at least one of the tracking stations. The processing device is configured to determine from the position information a location of the first vehicle relative to a location of the second vehicle.", "Tracking of autonomous systems "]
["Systems and methods are described for controlling a remote system. The controlling of the remote system comprises detecting a gesture of a body from gesture data received via a detector. The gesture data is absolute three-space location data of an instantaneous state of the body at a point in time and physical space. The detecting comprises identifying the gesture using the gesture data, The controlling comprises translating the gesture to a gesture signal, and controlling a component of the remote system in response to the gesture signal.", "Gestural control of autonomous and semi-autonomous systems "]
["A system for continuous monitoring and autonomous detection of patterns in the main memory subsystem of a computer system. The invention can be embodied as an extension to existing memory scrubbing hardware to permit stored code pattern analysis and identification during the autonomous transparent memory scrubbing process. A library of stored target signatures is provided to which code signatures are compared during analysis. Code signatures may be derived directly from the memory subsystem data pattern or may be indirectly and more efficiently derived from the error correction code (ECC) string associated with the stored data pattern. This invention is directly applicable to computer virus detection and neutralization systems.", "Autonomous system for recognition of patterns formed by stored data during computer memory scrubbing "]
["A motor with a variable speed controller is used to operate a hose reel for connecting a fuel source or decontaminant on a tanker plane to a fuel tank or other receptor on an unmanned vehicle. The hose reel is controlled to feed the fuel or other liquid through the hose and a drogue to a receiving probe on the unmanned vehicle and is also controlled to maintain the drogue in proper position. This end result is achieved by means of a controlling transponder on the unmanned vehicle which receives radio control signals from a communicating transponder on the tanker. A microcomputer processes the received control signals which are then fed to the motor controller. The motor controller not only controls the positioning of the drogue but also controls the motor so that excess hose is reeled in by the hose reel. The controller in addition controls the thrust power. A lidar tracker with a miniature video camera maintains a line of sight between the drogue and the receiver probe and tracks the drogue-probe.", "Autonomous system for the aerial refueling or decontamination of unmanned airborne vehicles "]
["In general, techniques are described for advertising end user content delivery reachability by content delivery networks (CDNs) to upstream content serving entities. In one example, a CDN interconnection (CDNI) device of a content serving entity receives a prefix advertisement that specifies a downstream entity and indicates the downstream entity provides content delivery reachability to the network address prefix. A request router of the CDNI device receives a content request that includes a request for content and specifies a network address of an end user device to receive the content, wherein the network address is within a range defined by the network address prefix. The request router selects the downstream entity to serve the content request based at least on the content delivery reachability indication and redirects the content request to the downstream entity.", "Advertising end-user reachability for content delivery across multiple autonomous systems "]
["A cellular radiotelephone (user terminal) (10) includes a keypad (22) having a plurality of keys (22a, 22b) and a display device (20) for displaying information, including messages, to a user. A method includes the steps of registering the user terminal with one of a plurality of networks, such as one of a first network or a second network, and receiving a signal at the user terminal indicating that at least one message is stored in a storage device associated with a message station within the network. The storage device stores voice messages for the radiotelephone. In response to receiving the signal, a step is performed of notifying the user that at least one message is stored in the storage device of the network with which the radiotelephone is registered. The user can request to retrieve the stored messages by depressing at least one predetermined key on the keypad. The user terminal responds to the user's request by determined the network with which the user terminal is registered, and then communicating with this network to retrieve the messages. Also, in accordance with the invention, the user can specify access codes for the storage device of each network. Identifier tags may also be employed to further identify the storage device of each network. The first and second networks include an autonomous network and a public network, respectively.", "Automatic public/autonomous system message waiting indicator (MWI) recognition "]
["The invention concerns a system for measuring and displaying physiological parameters. It comprises, on the one hand, a sensor or sensors and a measuring device attached to the body, and on the other hand, a separate display device, for example a digital watch attached to the wrist, receiving from the measuring device the parameters to be displayed in the form of digitalised radio signals. A first application example concerns the measurement of the ECG signal and the display of parameters relating to the heart. A second example concerns the measurement of blood sugar levels and the display of insulin doses to be injected, if required.", "Autonomous system for measuring, processing and transmitting essentially physiological parameters "]
["A denial-of-service network attack detection system is deployable in single-homed and multi-homed stub networks. The detection system maintains state information of flows entering and leaving the stub domain to determine if exiting traffic exceeds traffic entering the system. Monitors perform simple processing tasks on sampled packets at individual routers in the network at line speed and perform more intensive processing at the routers periodically. The monitors at the routers form an overlay network and communicate pertinent traffic state information between nodes. The state information is collected and analyzed to determine the presence of an attack.", "Detection of Distributed Denial of Service Attacks in Autonomous System Domains "]
["Systems, methods and apparatus are provided through which in some embodiments, an agent-oriented specification modeled with MaCMAS, is analyzed, flaws in the agent-oriented specification modeled with MaCMAS are corrected, and an implementation is derived from the corrected agent-oriented specification. Described herein are systems, method and apparatus that produce fully (mathematically) tractable development of agent-oriented specification(s) modeled with methodology fragment for analyzing complex multiagent systems (MaCMAS) and policies for autonomic systems from requirements through to code generation. The systems, method and apparatus described herein are illustrated through an example showing how user formulated policies can be translated into a formal mode which can then be converted to code. The requirements-based programming systems, method and apparatus described herein may provide faster, higher quality development and maintenance of autonomic systems based on user formulation of policies.", "Systems, methods and apparatus for modeling, specifying and deploying policies in autonomous and autonomic systems using agent-oriented software engineering "]
["A system for the automatic regulation of daylight admitted into a room, specifically intended for daylighting applications. A preferred embodiment, system 10, consisting of a conventional control unit 11, a conventional exterior brightness sensor 12, and a conventional electronically controlled window covering 13, operates to block direct solar radiation while admitting substantial diffuse illumination. Control unit 11, brightness sensor 12, and window covering 13 are interconnected in a known manner to enable control unit 11 to register the brightness of the external illumination, and to actuate window covering 13. Control unit 11 consists of a conventional microcontroller 14, a conventional real-time clock/calendar 15, and a conventional Non-Volatile Memory (NVM) 16. Microcontroller 14, clock/calendar 15, and NVM 16 are interconnected in a known manner to enable microcontroller 14 to register the output of clock/calendar 15, and to exchange data with NVM 16. NVM 16 holds pre-stored data which defines a desired setting of window covering 13 as a function of the time of the day and the day of the year, for the prevailing latitude, longitude, and window azimuth orientation. In the preferred embodiment, this desired setting is one which will block the admission of incident direct solar radiation, while still admitting substantial diffuse illumination. Microcontroller 14 periodically registers the exterior brightness as measured by sensor 12, registers the data stored in NVM 16, estimates a desired setting of window covering 14 on the basis of these data, and actuates window covering 13 to the desired setting.", "Autonomous, low-cost, automatic window covering system for daylighting applications "]
